# **Pandas DataFrame**

In [0]:
import numpy as np
import pandas as pd

In [0]:
columns = ['W', 'X', 'Y', 'Z']

In [0]:
index = ['A', 'B', 'C', 'D', 'E']

In [0]:
from numpy.random import randint

In [0]:
data = randint(-100, 100, (5, 4))

In [0]:
from numpy.random import randint

In [0]:
np.random.seed(42)
data = randint(-100, 100, (5, 4))

In [8]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [0]:
df = pd.DataFrame(data, index, columns)

In [10]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [11]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [12]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [13]:
df[['Z', 'W']]

    Z   W
A -86   2
B -80   6
C -13   2
D  51  16
E -99  30

In [0]:
df['new'] = df['W'] + df['Y']

In [15]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [16]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [17]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [0]:
df = df.drop('new', axis=1)

In [19]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [20]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [21]:
df.loc[['A', 'B']]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

In [22]:
df.loc[['A']]

   W   X  Y   Z
A  2  79 -8 -86

In [23]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [24]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [25]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [26]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [27]:
df.loc['A', 'W']

2

In [28]:
df.loc[['A', 'C'], 'W']

A    2
C    2
Name: W, dtype: int64

In [29]:
df.loc[['A', 'C'], ['W']]

   W
A  2
C  2

In [30]:
df.loc[['A', 'C'], ['W', 'Y']]

   W   Y
A  2  -8
C  2 -26

In [31]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [32]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [33]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [34]:
df[df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [35]:
# if you need only W column on this
df[df['X'] > 0]['W']

A     2
C     2
E    30
Name: W, dtype: int64

In [36]:
# if you want to pick first row on given condition.

df[df['X'] > 0].iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [37]:
# if you want two conditions, then follow the steps.
# First: write conditions.
# Second: wrap each condition in paranthesis
# Third: include condtion; & for and, | for or
# Fourth include every thing in df[]
df[(df['W'] > 0) &  (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [38]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [39]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
new_ind = ['TX', 'CA', 'NY', 'WY', 'OR']

In [0]:
df['States'] = new_ind

In [43]:
df

    W   X   Y   Z States
A   2  79  -8 -86     TX
B   6 -29  88 -80     CA
C   2  21 -26 -13     NY
D  16  -1   3  51     WY
E  30  49 -48 -99     OR

In [44]:
df.set_index('States')

         W   X   Y   Z
States
TX       2  79  -8 -86
CA       6 -29  88 -80
NY       2  21 -26 -13
WY      16  -1   3  51
OR      30  49 -48 -99

In [0]:
df = df.set_index('States')

In [46]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [47]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [50]:
# if you want info of data type and non-null
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, TX to OR
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [51]:
# if you need only info of data dtype
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object